; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	spectrograph0 - mode
	thermograph2 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	Star3 - direction
	Star5 - direction
	GroundStation6 - direction
	GroundStation7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star4 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Planet15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet12)
)
(:goal (and
	(have_image Star11 image1)
	(have_image Planet12 spectrograph0)
	(have_image Phenomenon13 image1)
	(have_image Planet14 spectrograph0)
	(have_image Planet15 thermograph2)
	(have_image Planet16 thermograph2)
	(have_image Phenomenon17 thermograph2)
	(have_image Star18 image1)
))

)

; plan
1. (turn_to satellite0 star4 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 star4)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet14)
   goals met: 0 of 8
5. (take_image satellite0 planet14 instrument0 spectrograph0)
   added: (have_image planet14 spectrograph0)
   goals met: 1 of 8
6. (turn_to satellite0 planet12 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet12)
   goals met: 1 of 8
7. (take_image satellite0 planet12 instrument0 spectrograph0)
   added: (have_image planet12 spectrograph0)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon17 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon17)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon17 instrument0 thermograph2)
   added: (have_image phenomenon17 thermograph2)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon13 phenomenon17)
   deleted: (pointing satellite0 phenomenon17)
   added: (pointing satellite0 phenomenon13)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon13 instrument0 image1)
   added: (have_image phenomenon13 image1)
   goals met: 4 of 8
12. (turn_to satellite0 planet15 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet15)
   goals met: 4 of 8
13. (take_image satellite0 planet15 instrument0 thermograph2)
   added: (have_image planet15 thermograph2)
   goals met: 5 of 8
14. (turn_to satellite0 planet16 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 planet16)
   goals met: 5 of 8
15. (take_image satellite0 planet16 instrument0 thermograph2)
   added: (have_image planet16 thermograph2)
   goals met: 6 of 8
16. (turn_to satellite0 star11 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 star11)
   goals met: 6 of 8
17. (take_image satellite0 star11 instrument0 image1)
   added: (have_image star11 image1)
   goals met: 7 of 8
18. (turn_to satellite0 star18 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star18)
   goals met: 7 of 8
19. (take_image satellite0 star18 instrument0 image1)
   added: (have_image star18 image1)
   goals met: 8 of 8
